---
kind: property
id: P:Autodesk.Revit.DB.Settings.Categories
source: html/66cb17a0-83b1-3aa7-ee9b-42f5d8dafd25.htm
---
# Autodesk.Revit.DB.Settings.Categories Property

Retrieves an object that provides access to all the categories contained in the Autodesk
Revit application and project.

## Syntax (C#)
```csharp
public Categories Categories { get; }
```